BOT_TOKEN = "А тебе все скажи))"

DAY_LIMIT = 3

ALLOWED_USERS = ["1015008397", "1070179116"]

GREETING_TEXT = 'Здравствуй, малыш. Через несколько секунд твоя жизнь изменится навсегда, она разделится на "до" и "после". Иногда жизнь приносит тяжелые испытания, и кажется, что проблема безнадёжна, но Гудтаймс crew уверены, что всегда можно найти путь к решению. Этот бот поможет принять сложные решения, узнать немного о нас и увидеть наши чудеса. Пользуйся этим ботом каждый день, и он защитит тебя и твоих близких от негативного влияния темных сил зла, наведения порчи, сглаза или родового проклятья. Помните Гудтаймс и Гудтаймс crew всегда рядом и готовы помочь. Не стесняйся общаться к этому боту за советом и поддержкой, ведь он несёт в себе свет и поддержку, помогая людям найти верный путь. Крюдания.....'
MAIN_TEXT = "Чем звёзды могут вам помочь?"

MAIN_BUTTONS = {"fortune_telling" : "Гадание",
                "ask_a_question" : "Задать вопрос", 
                "mailing" : "Управление гороскопом",
                "info" : "Информация"}

ADMIN_BUTTONS = {"mailing_test" : "Тест рассылки", 
                 "drop_limit" : "Сброс лимита", 
                 "set_fortune_telling" : "Обновить файл предсказаний на сервере", 
                 "get_fortune_telling" : "Получить файл предсказаний с сервера",
                 "set_answers" : "Обновить файл ответов на сервере", 
                 "get_answers" : "Получить файл ответов с сервера"}

QUESTION_TEXT = ["Что ты хочешь узнать у звёзд?", "Что тебя интересует?", "Какова твоя проблема?"]

SET_FILE_TEXT = "Отправьте файл"

SUCCESS_TEXT = "Команда выполнена"

ADMIN_BUTTON = "Админские команды"
ADMIN_TEXT = "Админские команды"

MAILING_TEXT = ["Хотите ли вы подключить гороскоп?", "Рассылка от звёзд не интересует?😏"]
MAILING_BUTTONS = {"subscribe" : "Подключить гороскоп", 
                   "unsubscribe" : "Отключить гороскоп"}                                                                  
MAILING_STАRT_TEXT = "Прямая связь со звёздами налажена"
MAILING_END_TEXT = "Прямая связь со звёздами утеряна, ты все разрушил!!"

FORTUNE_TELLING_FILE_NAME = "files/fortune-telling.txt"

HOROSCOPE_TEXT = """♈️Овен: {a}

♉️Телец: {b}

♊️Близнецы: {c}

♋️Рак: {d}

♌️Лев: {e}

♍️Дева: {f}

♎️Весы: {g}

♏️Скорпион: {h}

♐️Стрелец: {i}

♑️Козерог: {j}

♒️Водолей: {k}

♓️Рыбы: {l}
"""

ANSWERS_FILE_NAME = "files/answers.txt"

INFO_TEXT = "Информация о Гудтаймс crew и Гудтаймс. О ком вы хотите узнать?"
INFO_BUTTONS = {"crew" : "О Гудтаймс crew", 
                "band" : "О Гудтаймс"}


INFO_CREW_TEXT = "Здесь вы можете узнать о нас немного побольше 😊"
INFO_CREW_BUTTONS = {"about" : "Ссылки на нас", 
                     "photo" : "Мы горим", 
                     "help" : "Помочь проекту"}
INFO_CREW_CONTACT_TEXT = """С помощью данных ссылок вы можете следить за нашей жизнью в социальных сетях.

Cсылка на нас в ВК: https://vk.com/crewgoodtimes
Ссылка на наш Ютуб: https://youtube.com/@crewgoodtimes?si=-yt7AZx9O7Ehxw62
Ссылка на наш Инстаграм: instagram.com/goodtimes.crew"""
INFO_CREW_HELP_TEXT = '''При желании вы можете помочь нашему проекту финансово. 

Для этого вам нужно написать в личные сообщения группы в ВК "Гудтаймс crew" (ссылка на нее находится в разделе "Ссылки"). 
И вам предоставят актуальные реквизиты. 

Заранее спасибо за помощь ❤️😇
'''
INFO_CREW_PHOTO_TEXT = """Здесь вы можете лицезреть фотографии с концертов. 

Ссылки на наши альбомы: https://vk.com/albums-112867684"""


INFO_BAND_TEXT = " Здесь вы можете найти полезную информацию про нашу любимую группу Гудтаймс"
INFO_BAND_BUTTONS = {"links" : "Ссылки на группу", 
                     "events" : "Концерты"}
INFO_BAND_LINK_TEXT = """Официальные ресурсы группы: 

Ссылка на ВК: https://vk.com/goodtimesband 
Ссылка на ТГ: https://t.me/goodtimesofficial
Ссылка на официальный сайт: http://gtband.ru
Ссылка на Ютуб: https://www.youtube.com/channel/UC1GsV8mt3Ab5gsKLb3sa3xw
Ссылка на Инстаграм: https://www.instagram.com/good_times_band/"""
INFO_BAND_EVENTS_TEXT = """Здесь вы можете узнать о будущих концертах группы:

Ссылка на официальный сайт: https://gtband.ru/#gigs
Ссылка на афишу в ВК: https://vk.com/app6819359_-8415304"""


DISTRIBUTION_BUTTON = "Назад в меню"                                                                             


FORTUNE_TELLING_BUTTONS = ["Получить еще одно предсказание"]
FORTUNE_TELLING_LIMIT_TEXT = "Вы уже получили предсказание 3 раза, приходите завтра!"                               


PRESS_BUTTON_TEXT = "Пожалуйста, выберите вариант из предложеных ниже."